In [1]:
import pandas as pd
td=pd.read_csv("titanic_train.csv")
td.shape

(891, 12)

In [2]:
#percentage of people survived in titanic
td['Survived'].mean()

0.3838383838383838

In [3]:
# Mean Age Of People travelling int the titanic
td['Age'].mean()

29.69911764705882

In [4]:
# mean fare of tickets purchased
td['Fare'].mean()

32.2042079685746

In [6]:
#Getting list of survived people
tc=td.copy()
survived=tc[tc.Survived==1]

In [7]:
print("Survived people")
print(survived.shape[0])
print("out of ")
print(td.shape[0])

Survived people
342
out of
891

In [9]:
# Classifing by Passenger class
print ("Count of people survived in passenger class 1 were", end=' ')
print(survived[survived.Pclass==1].shape[0])
print()
print ("Count of people survived in passenger class 2 were", end=' ')
print(survived[survived.Pclass==2].shape[0])
print()
print ("Count of people survived in passenger class 3 were", end=' ')
print(survived[survived.Pclass==1].shape[0])

Count of people survived in passenger class 1 were 136

Count of people survived in passenger class 2 were 87

Count of people survived in passenger class 3 were 136

In [10]:
#calculate percentage of male in titanic
tdsex=td.copy()
def f(s):
    if s=="male":
        return 0
    else:
        return 1
    
tdsex["Gender"]=tdsex.Sex.apply(f)


# As of now all genders with 1 are male and with zero are females

print("Percentage of males in the ship were" , end = ' ')
print(tdsex[tdsex.Gender==1].shape[0]/td.shape[0])

Percentage of males in the ship were 0.35241301907968575

In [11]:
tdsex.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Gender
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [13]:
# Calculating the percentage of males and females survived
# For Females
fs=tdsex.copy()
femaledb=fs[fs.Gender==0]

print ("Total females is the titanic were" , end =' ')
print(femaledb.shape[0])

print("Amount of females survived were" , end =' ')
print (femaledb[femaledb.Survived==1].shape[0])
print()


# For Males
ms=tdsex.copy()
maledb=ms[ms.Gender==1]

print ("Total males is the titanic were" , end =' ')
print(maledb.shape[0])

print("Amount of males survived were" , end =' ')
print (maledb[maledb.Survived==1].shape[0])

Total females is the titanic were 577
Amount of females survived were 109

Total males is the titanic were 314
Amount of males survived were 233